# ModelCurveArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveArray Class
Members See Also
---
An array that contains model curves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ModelCurveArray : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class ModelCurveArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class ModelCurveArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ModelCurveArray
# See Also
ModelCurveArray Members
Autodesk.Revit.DB Namespace